In [1]:
import pandas as pd

In [2]:
# Create DataFrame
st_marks={"Roll_No":[101,102,103,104,102,105],"Name":["Kartik","Abhishek","Sandeep","Rohit","Abhishek","Rohit"],
          "Python":[67,65,54,69,65,69]}
df=pd.DataFrame(st_marks)
df

   Roll_No      Name  Python
0      101    Kartik      67
1      102  Abhishek      65
2      103   Sandeep      54
3      104     Rohit      69
4      102  Abhishek      65
5      105     Rohit      69

In [3]:
#check Duplicate Values
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [4]:
# Remove Duplicates Value
df.drop_duplicates()

   Roll_No      Name  Python
0      101    Kartik      67
1      102  Abhishek      65
2      103   Sandeep      54
3      104     Rohit      69
5      105     Rohit      69